In [28]:
import seaborn as sns
import numpy as np
import pandas as pd

In [2]:
df=sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [4]:
#[survived,  pclass , sex , embarked , alone ]
df=df[['survived','pclass','sex','embarked','alone']]

In [5]:
 df.head()

   survived  pclass     sex embarked  alone
0         0       3    male        S  False
1         1       1  female        C  False
2         1       3  female        S   True
3         1       1  female        S  False
4         0       3    male        S   True

In [6]:
#Before applying chi sqaure testing, we have to apply label encoding different - different categories:

In [7]:
df['sex']=np.where(df['sex']=="male",1,0)

In [10]:
ol={k:i for i,k in enumerate (df['embarked'].unique())}
df['embarked']=df['embarked'].map(ol)

In [16]:
df['alone']=np.where(df['alone']==True,1,0)

In [17]:
df.head()

   survived  pclass  sex  embarked  alone
0         0       3    0         0      0
1         1       1    0         1      0
2         1       3    1         0      1
3         1       1    0         0      0
4         0       3    1         0      1

In [22]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(df[['pclass','sex','embarked','alone']],df['survived'],test_size=0.3,random_state=100)

In [23]:
X_train.head()

     pclass  sex  embarked  alone
69        3    0         0      0
85        3    0         0      0
794       3    1         0      1
161       2    1         0      1
815       1    1         0      1

In [24]:
#lets perform Chi square test.
#It returns 2 values: 1. f_score & P_value P_value is nothing but probability value

In [25]:
from sklearn.feature_selection import chi2
fpvalue=chi2(X_train,y_train)

In [26]:
fpvalue

(array([21.97994154, 10.88471585,  7.55053653, 10.88471585]),
 array([2.75514881e-06, 9.69610546e-04, 5.99922095e-03, 9.69610546e-04]))

In [30]:
p_values=pd.Series(fpvalue[1])
p_values.index=X_train.columns
p_values

pclass      0.000003
sex         0.000970
embarked    0.005999
alone       0.000970
dtype: float64

In [32]:
p_values.sort_index(ascending=False)

sex         0.000970
pclass      0.000003
embarked    0.005999
alone       0.000970
dtype: float64